sdk-php/tests/MercadoPago/Resources/Mocks/Response/PreApprovalPlan/preapprovalplan_update.json

{
    "id": "2c9380848a610f84018a6543a3010320",
    "back_url": "https://www.yoursite.com",
    "collector_id": 1160535239,
    "application_id": 1979447422004048,
    "reason": "reason",
    "status": "active",
    "date_created": "2023-09-05T08:14:06.082-04:00",
    "last_modified": "2023-09-05T11:11:23.599-04:00",
    "init_point": "https://www.mercadopago.com.br/subscriptions/checkout?preapproval_plan_id=2c9380848a610f84018a6543a3010320",
    "auto_recurring": {
        "frequency": 1,
        "frequency_type": "months",
        "transaction_amount": 10.00,
        "currency_id": "BRL",
        "repetitions": 12,
        "free_trial": {
            "frequency": 1,
            "frequency_type": "months",
            "first_invoice_offset": 30
        },
        "billing_day": 10,
        "billing_day_proportional": true,
        "transaction_amount_proportional": 1.67
    },
    "payment_methods_allowed": {}
}
